{
  "name": "Carol Carvalhosa",
  "mail": "ccscarvalhosa@gmail.com",
  "linkedin": "https://linkedin.com/in/carolina-carvalhosa/",
  "occupation": "Software Engineer",
  "education": "Computer Science Bachelor's Degree",
  "university": "UERJ",
  "universityFullName": "State University of Rio de Janeiro",
  "educationEndDate": "11/23",
  "summary": "I'm a software engineer that thrives in fast-paced environments where I can build great web and mobile products and mentor other engineers too.",
  "skills": [
    "NodeJS, ReactJS, JavaScript and TypeScript",
    "UI/UX, Advanced CSS",
    "C# .NET Core MVC, .NET Framework",
    "Git and TFS",
    "S3, DynamoDB, SQL Server, PostgreSQL and MySQL",
    "Docker and Podman",
    "ETL, Data Analysis and Data Visualization",
    "Flutter, Python and Java",
    "Troubleshooting and Debottlenecking",
    "Performance Optimization",
    "Data lake",
    "AzureDevOps and Scrum",
    "Jest and @testing-library",
    "Storybook and VS Code documentation",
    "AWS, AWS Serverless Architecture, AWS Lambda"
  ],
  "avatar": "https://avatars.githubusercontent.com/u/43474430?v=4",
  "website": "https://carolcarvalhosa.github.io/portfolio/",
  "github": "carolcarvalhosa",
  "githubLink": "https://github.com/CarolCarvalhosa",
  "title": "Portfolios",
  "portfolios": [
    {
      "id": "web-mobile-dev",
      "name": "Web & Mobile",
      "description": "Front-end & Back-end development skills",
      "active": true,
      "projects": [
        {
          "id": "equipment-management-sys",
          "name": "Equipment Management",
          "skills": ["ReactJS", "TypeScript", "NodeJS", "RabbitMQ"]
        },
        {
          "id": "portfolio",
          "name": "Portfolio",
          "skills": ["ReactJS", "TypeScript"]
        },
        {
          "id": "go-barber",
          "name": "Go Barber",
          "skills": ["ReactJS", "NodeJS", "TypeScript"]
        },
        {
          "id": "be-the-hero",
          "name": "Be The Hero",
          "skills": ["ReactJS", "NodeJS", "Expo"]
        }
      ]
    },
    {
      "id": "game-dev",
      "name": "Game",
      "description": "Unity Engine development skills",
      "active": false,
      "projects": []
    },
    {
      "id": "design-art",
      "name": "Design & Art",
      "description": "Illustration, Visual Identity & Draw skills",
      "active": false,
      "projects": []
    }
  ],
  "softSkills": [
    {
      "title": "Fast learner",
      "description": "I love challenges and I'm used to working in fast paced environments. I'm always searching for extra knowledge that can help problem solve."
    },
    {
      "title": "Team player",
      "description": "I have worked on both big and small team settings collaboratively and effectively."
    },
    {
      "title": "Task Management",
      "description": "I'm used to taking responsibility and managing my tasks in a timely manner. I'm used to working on more than one team at the same time"
    },
    {
      "title": "Helpful Mentor",
      "description": "I love sharing my knowledge and collaborating with others to help come up with solutions."
    }
  ],
  "workHistory": [
    {
      "occupation": "SOFTWARE CONSULTANT [05/23 - present]",
      "place": "Deloitte",
      "projects": [
        "Created AWS infrastructure for a CFD (Computer Fluid Dynamics) project that included creation of an HPC cluster and a Windows EC2 with a VPN.",
        "Provided Software support and improvements on a serverless project using ReactJS, NodeJS, Git, AzureDevOps and Scrum. The Project was evolving into a e-commerce. I refactored the legacy structure and integrated some new features. In addition, I maintained the on-premise servers and created a containerized infrastructure for the applications using Docker. This project was using ETLs to bring data from the client's data lake into the application where I was able to make major structural and performance improvements.",
        "Provided architectural guidance on a project using Flutter with a Java back-end. The Project goal was to create a mobile app that controlled production data from several databases for the client's internal use. I was responsible for the architecture of the project and the integration of the back-end with the front-end. I also provided guidance on the best practices for the project and helped the team to understand the Flutter framework.",
        "Built a ReactJS front-end and a Python FastAPI with AI models integration. The Project goal was to create a chatbot to help professionals to make strategic decisions quickly based on company data analysis."
      ]
    },
    {
      "occupation": "SOFTWARE ENGINEER [08/20 - 05/23]",
      "place": "Radix",
      "projects": [
        "Responsible for building an UIKit ReactJS library with Storybook documentation and testing by @testing-library, which provided DOM APIs, such as Jest and Mocha + JSDOM. The Project goal was to provide styled components for screens so that they \ncan be created on a faster and easier way.",
        "Created projects from scratch using ReactJS, C# .NET Core, Git, AzureDevOps and Scrum. The Project goal was the creation of a framework that was used as a starting point for later projects. It uses the previous ReactJS UIKit.",
        "Provided Software support and improvements on projects using ReactJS, C# .NET Core, Git, AzureDevOps and Scrum. The Project goal was to gather data on active Petroleum tanks for reports. It consumed an API to show each tank's levels and triggered notifications to certain user groups."
      ]
    },
    {
      "occupation": "DEVELOPER [01/20 - 08/20]",
      "place": "Radix",
      "projects": [
        "Provided Software support and improvements using MVC architecture, C# .NET, Entity Framework, SQL Server, JS, HTML, CSS, TFS, AzureDevOps and Scrum. The Project goal was to manage trainings and documents for petroleum platform employees. The system is used globally and uses replication to synchronize applications across all platforms."
      ]
    }
  ],
  "educationHistory": [
    {
      "occupation": "SOLUTIONS ARCHITECT ASSOCIATE [12/23]",
      "place": "AWS",
      "projects": ["Certified in AWS Solutions Architect Associate exam."]
    },
    {
      "occupation": "UNIVERSITY SCHOLARSHIP [03/19 - 12/20]",
      "place": "UERJ",
      "projects": [
        "Provided visualization development using the D3.js and website development support working with HTML, CSS, Jekyll and Git."
      ]
    },
    {
      "occupation": "ENGLISH CERTIFICATE [11/18]",
      "place": "WISE UP",
      "projects": ["Advanced english level."]
    }
  ],
  "codeContributions": [
    {
      "occupation": "GITLAB [01/20 - 06/20]",
      "projects": [
        "Provided small front-end contributions to the open source project https://gitlab.com/gitlab-org/gitlab."
      ]
    }
  ]
}
